[
    {
        "title": "Lea Salonga, voice of ‘Mulan’ and Princess Jasmine, to perform at Segerstrom Center",
        "content": "Born and raised in the Philippines, Lea Salonga grew up watching Disney movies and listening to Disney storybook tapes. Never did she imagine, though, that she would grow up to be a real-life, bona fide Disney Princess.\n\nThen, after earning a Tony Award for her portrayal of Kim in the Broadway musical “Miss Saigon” in 1991, Salonga landed the career break of a lifetime: to be the singing voice of Princess Jasmine in the 1992 hit Disney film “Aladdin.”\n\nSix years later, she got a second chance to live her young girl’s dream as she performed the vocals of Mulan in the 1998 Disney film of that name.\n\n“I never thought when I was 5 and listening to ‘Cinderella’ stories that I’d be a Disney princess. I think it’s such a magical thing to happen in my life, and for it to happen twice is something I would never have thought could happen,” said Salonga in a recent phone interview.\n\nSalonga’s distinctive voice will return to Southern California for concerts tonight at the Valley Performing Arts Center in Northridge and Saturday at Segerstrom Center for the Arts. Backed by a four-piece band, Salonga will perform a selection of well-known songs, including her greatest hits from her various musicals and films.\n\n“We made sure to choose a fun program that the band is going to dig playing and I’m going to love singing,” said Salonga, “and because we are having so much fun onstage, I hope that translates to the audience as well.”\n\nSalonga is keeping the program’s song selections a secret for now, until she and her musical director decide on the set list; however, she promises all of the tunes will be familiar and fit her vocal range. Some of the songs, she added, will be making their California debut.\n\n“This will be the first time for California audiences to hear these songs, but there is nothing unknown or out of left field; stuff that always makes sense with my voice.”\n\nA regular feature of Salonga’s solo concerts is an audience participation segment, in which she chooses someone to join her onstage to sing the Grammy and Academy Award-winning duet “A Whole New World” from “Aladdin.”\n\n“No need to panic; we always have a lyric sheet so anyone who dares to come up doesn’t have to have it memorized fully,” she said. “I want them to have fun.”\n\nSalonga has numerous Broadway credits, including her role as Eponine in the 1993 “Les Misérables” Broadway run and as Fantine in the 2006 Broadway revival. She recently came off Broadway in the new musical “Allegiance,” which also starred George Takei and Telly Leung.\n\nSplitting her time between the U.S. and Manila, Salonga is a coach on the Philippine version of the television show “The Voice.” In addition to her onscreen and onstage career, she has released several solo albums, including “I’d Like to Teach the World to Sing” (1997) and “By Heart” (1999).\n\nOn this tour, Grammy-nominated bass player Trey Henry and drummer Ray Brinker, both from the jazz group Tierney Sutton Band, will back Salonga.\n\n“I get to go up onstage with musicians who I really admire and respect, and just have a great time with,” Salonga said. “It’s thrilling when I get to perform stuff where I can just emotionally let go and fly off to another world in my mind, and the audience gets to ride on that too.”\n\nContact the writer: jmoe@ocregister.com",
        "label": 0,
        "comments": [
            {
                "gender": "male",
                "age": "You are under 17 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "\"I grew up listening to Lea Salonga as the voices of Jasmine and Mulan, and now I have a chance to see her perform live! Can't wait for the concert 🎶✨ #disneyprincess\""
            },
            {
                "gender": "male",
                "age": "You are under 17 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Omg, Lea Salonga is the real Disney princess we all need! So cool that she's performing her greatest hits in concerts, wish I could go see her live! #LeaSalonga #DisneyPrincess 🎶👸✨"
            },
            {
                "gender": "male",
                "age": "You are under 17 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "OMG, Lea Salonga is living the dream as a Disney princess not once, but twice! So cool to see her perform live, can't wait to hear her vocals in person! 🌟 #DisneyPrincess #LeaSalonga #ConcertTour"
            },
            {
                "gender": "male",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "Being a Disney fan myself, it's amazing to see Lea Salonga living out the dream of being a Disney Princess not once, but twice. Can't wait to hear her perform live! ✨ #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Lea Salonga's journey from being a Disney Princess to a Broadway star is so inspiring! Can't wait to see her perform in California. #LeaSalonga #DisneyPrincess #BroadwayStar 🎶✨"
            },
            {
                "gender": "male",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Wow, Lea Salonga living every '90s kid's dream of being a Disney Princess twice! So cool to see her performing live in Southern California. #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "As a Disney fan and a fan of Lea Salonga, I can't wait to hear her perform live! Her voice is truly magical. #LeaSalonga #DisneyPrincess #ConcertExcitement 🎶✨"
            },
            {
                "gender": "male",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "This is so inspiring! Lea Salonga living the dream as a real-life Disney Princess with her amazing voice! Can't wait to hear her perform in California! #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "I can't believe Lea Salonga got to be the singing voice of not one, but two Disney princesses! What a dream come true for her! #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "As a Disney fan and a music lover, it's amazing to see Lea Salonga's journey from listening to Disney stories to becoming the singing voice of Princess Jasmine and Mulan. Such a magical experience for her and fans alike! ✨ #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Wow, Lea Salonga is a true Disney princess, not just once but twice! What an incredible journey from watching Disney movies as a kid to becoming the singing voice of Princess Jasmine and Mulan. #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "male",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "What a magical journey for Lea Salonga from Disney Princess to Broadway star! Excited to hear her perform in Southern California! #LeaSalonga #DisneyPrincess #BroadwayStar 🎶✨"
            },
            {
                "gender": "male",
                "age": "You are over 65 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "What an incredible journey for Lea Salonga! From growing up watching Disney movies to becoming the singing voice of iconic Disney Princesses, she truly is a real-life Disney Princess. #Disney #LeaSalonga #MusicLegend"
            },
            {
                "gender": "male",
                "age": "You are over 65 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Wow, Lea Salonga's journey from Disney Princess to Broadway star is truly inspiring! Can't wait to hear her perform in Southern California. #LeaSalonga #DisneyPrincess #BroadwayStar 🌟🎶"
            },
            {
                "gender": "male",
                "age": "You are over 65 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Wow, Lea Salonga's journey from Disney princess to Broadway star is truly inspiring! Can't wait to hear her perform live in California. #LeaSalonga #DisneyPrincess #BroadwayStar"
            },
            {
                "gender": "female",
                "age": "You are under 17 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "Wow, Lea Salonga's journey from Disney princess to Broadway star is so inspiring! Can't wait to see her perform her greatest hits live! 🌟 #LeaSalonga #DisneyPrincess #BroadwayStar"
            },
            {
                "gender": "female",
                "age": "You are under 17 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "This is so inspiring! Lea Salonga living her dream as a Disney Princess and sharing her talent in concerts. Can't wait to see her perform! ✨🎤 #DisneyPrincess #LeaSalonga #Concerts"
            },
            {
                "gender": "female",
                "age": "You are under 17 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "OMG! Lea Salonga is the ultimate Disney princess both on screen and on stage! So cool to see her performing live in Southern California. Can't wait to see her sing all those classic Disney tunes! ✨🎶 #DisneyPrincess #LeaSalonga #Concerts"
            },
            {
                "gender": "female",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "I have always admired Lea Salonga and her incredible talent. It's amazing to see her live out her childhood dream of being a Disney Princess. Can't wait to hear her sing live! ✨ #LeaSalonga #DisneyPrincess"
            },
            {
                "gender": "female",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Wow, Lea Salonga's journey from Disney Princess to Broadway star is so inspiring! Can't wait to see her perform live. ✨ #LeaSalonga #DisneyPrincess #BroadwayStar"
            },
            {
                "gender": "female",
                "age": "You are 18 to 29 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Such an inspiring journey for Lea Salonga! From a young girl dreaming of Disney princesses to becoming the voice of Princess Jasmine and Mulan. What a magical experience for her! #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "female",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "As a Filipino-American and Disney fan, it's so amazing to see Lea Salonga living out her dream by being the singing voice of not just one, but two Disney princesses! Can't wait to see her in concert in Southern California. #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "female",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "How amazing is it that Lea Salonga, a real-life Disney Princess, gets to perform in concerts singing all the iconic Disney songs?! I wish I could join her on stage for \"A Whole New World\"! #DisneyPrincess #LeaSalonga #DreamComeTrue 🎤👸🏻"
            },
            {
                "gender": "female",
                "age": "You are 30 to 49 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Wow, Lea Salonga truly is a real-life Disney Princess! Such a magical journey from watching Disney movies as a kid to becoming the singing voice of Princess Jasmine in Aladdin and Mulan. Can't wait to see her perform in California! #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "female",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "As a college grad and Disney fan, it's amazing to see how Lea Salonga went from watching Disney movies to becoming the singing voice of two iconic Disney Princesses! 🌟 #DisneyMagic #LeaSalonga #DreamsComeTrue"
            },
            {
                "gender": "female",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Wow, Lea Salonga's journey from Disney Princess to Broadway star is truly inspiring! Her voice is pure magic. #LeaSalonga #DisneyPrincess"
            },
            {
                "gender": "female",
                "age": "You are 50 to 64 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Oh, I love Lea Salonga's voice! Such a talented singer and to think she's been the voice of two Disney princesses is just amazing. Can't wait to see her perform live! ✨🎶 #LeaSalonga #DisneyPrincesses"
            },
            {
                "gender": "female",
                "age": "You are over 65 years old.",
                "education": "Educationally, you are a college grad.",
                "comment": "\"Oh, how magical! Love hearing about Lea Salonga's journey as a Disney Princess and her upcoming concerts in California. Can't wait to see her perform live! 🌟 #DisneyPrincess #LeaSalonga #Concert\""
            },
            {
                "gender": "female",
                "age": "You are over 65 years old.",
                "education": "Educationally, you haven't graduated from college.",
                "comment": "Wow, Lea Salonga has truly lived out every young girl's dream of being a Disney Princess! I can't believe she got to be the singing voice for both Jasmine and Mulan. What a magical career she has had! #DisneyPrincess #LeaSalonga"
            },
            {
                "gender": "female",
                "age": "You are over 65 years old.",
                "education": "Educationally, you have a high school diplomma or less.",
                "comment": "Wow, Lea Salonga truly is a real-life Disney Princess! So inspiring to see someone from the Philippines achieving such success in the entertainment industry. #LeaSalonga #DisneyPrincess #Inspiration 🌟👑"
            }
        ]
    }
]